---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BentFabricParamLongitudinalCutLength
source: html/a9b69689-178d-2041-a92e-cd1c0187a1bd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BentFabricParamLongitudinalCutLength Property

"Longitudinal Cut Length": Bent fabric longitudinal cut length.

## Syntax (C#)
```csharp
public static ForgeTypeId BentFabricParamLongitudinalCutLength { get; }
```